# 450+ Practice Questions That Will Make You a Pandas, NumPy, and SQL Pro!

Author: Avi Chawla

LinkedIn: https://www.linkedin.com/in/avi-chawla/

Read my blogs here: https://medium.com/@avi_chawla

## Introduction

This notebook has been created for you to practice three of the most common tools used in building any machine learning or data science applications, i.e., Pandas, NumPy, and SQL!

The practice questions provided will serve as a great resource for those who are looking to familiarize themselves with some of the most common functions used in these tools.

Appropriate descriptions have been provided for all the questions in this entire exercise which will help you navigate through this exercise easily. If a dataset is to be loaded in the python environment, that has also been provided for you. You can find it on the right panel in the Files section. Do NOT delete any of the files/folders listed there.

The whole exercise has been divided into nine separate notebooks. Below are the links to all the other notebooks for you to jump from one notebook to another:

- **Pandas**

1. Pandas Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-1-d693ac55-6455-40cf-ae34-867c6a02014e/%2Fnotebook.ipynb) 
2. Pandas Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-dataset-7e3b6755-5d4b-464b-9b75-9c84667ae3bd/%2Fnotebook.ipynb) **(This Notebook)** 

3. Pandas Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/%2Fnotebook.ipynb)

4. Pandas Notebook 4: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-after-employee-f84e02a1-fb6a-428e-af90-8dd99855749a/%2Fnotebook.ipynb)

- **NumPy**

1. NumPy Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Numpy-part-1-9b9979f2-b708-4292-b466-3d0157564c91/%2Fnotebook.ipynb)

2. NumPy Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-2-4456411e-2ddd-426d-8027-4881080027db/%2Fnotebook.ipynb)

3. NumPy Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-3-e6587114-b580-4249-b599-540de859e603/%2Fnotebook.ipynb)

- **SQL**

1. SQL Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-1-eac9d782-a9b1-4e84-a1f9-af14080a6121/%2Fnotebook.ipynb)

2. SQL Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-2-1914b214-be03-44a1-be63-ad99e98be639/%2Fnotebook.ipynb)

## How to use this notebook?

At the top right corner, you will find a Duplicate button. This will allow you to create a unique notebook for your own practice and write solutions to the question listed in this notebook.

If you face any issues or have any feedback, feel free to reach out to me (Avi Chawla) either on Linkedin: https://www.linkedin.com/in/avi-chawla/ or write an email to avi@dsscholar[dot]com.

Let's begin ðŸš€!

# Pandas Notebook 2

### 31. Read the CSV file.

In [1]:
import pandas as pd

In [2]:
file_name = "employee_dataset.csv"

df = pd.read_csv(file_name)

### 32. Print the first 5 rows.

In [3]:
df_temp = df.head(5)

df_temp

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8

### 33. Print the last 10 rows.

In [4]:
df_temp = df.tail(10)

df_temp

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
299990,Monica Bender,"Wallace, Smith and Shepard",Production engineer,New Cindychester,Bangladesh,852660,Full Time,3.0
299991,William Rodriguez,Scott Inc,Ergonomist,Whiteside,New Zealand,214400,Full Time,1.5
299992,Steven Thornton,"Baker, Allen and Edwards",Patent examiner,Aliciafort,Benin,60240,Full Time,4.3
299993,Terry Hill,"White, Mcclain and Cobb","Investment banker, corporate",New Cindychester,Sweden,414720,Intern,2.3
299994,Kelly Bennett,"White, Mcclain and Cobb","Radiographer, therapeutic",Wardfort,Fiji,182270,Full Time,3.6
299995,Nancy Neal,Bullock-Carrillo,Optometrist,North Melissafurt,Samoa,99670,Intern,3.3
299996,Michele Butler,"Johnston, Fleming and Tanner",Administrator,Aliciafort,Cuba,949580,Intern,2.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830,Full Time,0.6
299998,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240,Full Time,2.4
299999,Karen Delgado,James and Sons,Actuary,New Russellton,United Kingdom,575770,Intern,3.3

### 34. Print the number of rows.

In [5]:
rows = df.shape[0]

print(rows)

300000

### 35. Print the number of columns.

In [6]:
columns = df.shape[1]

print(columns)

8

### 36. Print all column names.

In [7]:
column_names = df.columns
print(column_names)

Index(['Name', 'Company_Name', 'Employee_Job_Title', 'Employee_City',
       'Employee_Country', 'Employee_Salary', 'Employment_Status',
       'Employee_Rating'],
      dtype='object')

### 37. Print the mean of Employee_Salary.

In [8]:
df["Employee_Salary"].mean()

500224.20772666665

### 38. Print the mean of Employee_Rating.

In [9]:
df["Employee_Rating"].mean()

2.5059550000000006

### 39. Print the number of distinct Company_Name.

In [10]:
df["Company_Name"].nunique()

15

### 40. Print all the distinct Company_Name.

In [11]:
df["Company_Name"].unique()

array(['James and Sons', 'Nichols-James', 'Scott Inc',
       'Johnston, Fleming and Tanner', 'Baker, Allen and Edwards',
       'Andrade LLC', 'Matthews Inc', 'Taylor-Ramos',
       'Campos, Reynolds and Mccormick', 'White, Mcclain and Cobb',
       'Thomas-Spencer', 'Bullock-Carrillo', 'Marshall-Holloway',
       'Wallace, Smith and Shepard', 'Nelson-Li'], dtype=object)

### 41. Print the number of employees working in the company "Nichols-James".

In [12]:
df.query("Company_Name=='Nichols-James'").shape[0]

19911

### 42-44. Print the maximum, minimum and median Employee_Salary.

In [13]:
print(f"Maximum = {df['Employee_Salary'].max()}")
print(f"Minimum = {df['Employee_Salary'].min()}")
print(f"Median = {df['Employee_Salary'].median()}")

Maximum = 999990
Minimum = 0
Median = 500780.0

### 45-49. Print the distribution of the following columns: (the frequency of individual entries).

1. Company_Name

In [14]:
df["Company_Name"].value_counts()

Scott Inc                         20390
White, Mcclain and Cobb           20261
Thomas-Spencer                    20142
Nelson-Li                         20132
Taylor-Ramos                      20122
Baker, Allen and Edwards          20084
Matthews Inc                      20083
Bullock-Carrillo                  20063
Andrade LLC                       19983
Campos, Reynolds and Mccormick    19927
Nichols-James                     19911
James and Sons                    19868
Marshall-Holloway                 19859
Johnston, Fleming and Tanner      19811
Wallace, Smith and Shepard        19364
Name: Company_Name, dtype: int64

2. Employee_Job_Title

In [15]:
df["Employee_Job_Title"].value_counts()

Diplomatic Services operational officer                  30137
Administrator                                            15222
Garment/textile technologist                             15183
Trading standards officer                                15155
Patent examiner                                          15085
Armed forces logistics/support/administrative officer    15050
Retail merchandiser                                      15033
Energy manager                                           15033
Actuary                                                  15030
Investment banker, corporate                             15008
Ergonomist                                               15006
Production engineer                                      15003
Equities trader                                          15000
Naval architect                                          14905
Radiographer, therapeutic                                14882
Regulatory affairs officer                               14869
Optometrist                                              14838
Sales promotion account executive                        14820
Make                                                     14741
Name: Employee_Job_Title, dtype: int64

3. Employee_City

In [16]:
df["Employee_City"].value_counts()

North Melissafurt    30209
Kristaburgh          30204
Wardfort             30097
Ricardomouth         30052
Aliciafort           30037
New Russellton       30001
West Jamesview       29941
Whitakerbury         29854
Whiteside            29849
New Cindychester     29756
Name: Employee_City, dtype: int64

4. Employee_Country

In [17]:
df["Employee_Country"].value_counts()

Congo                                                  2413
Korea                                                  2301
British Indian Ocean Territory (Chagos Archipelago)    1344
Egypt                                                  1322
Turkey                                                 1308
                                                       ...
Saint Vincent and the Grenadines                       1147
Czech Republic                                         1145
Mexico                                                 1144
Mauritania                                             1139
Ukraine                                                1133
Name: Employee_Country, Length: 243, dtype: int64

5. Employment_Status

In [18]:
df["Employment_Status"].value_counts()

Full Time    240010
Intern        59990
Name: Employment_Status, dtype: int64

### 50. Print the company with the most number of employees.

In [19]:
df["Company_Name"].value_counts().index[0]

'Scott Inc'

### 51. Print the number of employees in the above company.

In [20]:
df["Company_Name"].value_counts()[0]

20390

### 52. Print the company with the least number of employees.

In [21]:
df["Company_Name"].value_counts().index[-1]

'Wallace, Smith and Shepard'

### 53. Print the number of employees in the above company.

In [22]:
df["Company_Name"].value_counts()[-1]

19364

### 54. Print the employee details with the maximum salary

In [23]:
df.sort_values("Employee_Salary", ascending=False).iloc[0:1, :]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
70356,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990,Full Time,4.0

### 55. Print the employee details with the maximum rating

In [24]:
df.sort_values("Employee_Rating", ascending=False).iloc[0:1, :]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
222544,Laura Lopez,Scott Inc,Equities trader,Whiteside,British Virgin Islands,271140,Full Time,5.0

### 56. Print the Company_Name with most number of employees in 'Wardfort' city.

In [25]:
df.query("Employee_City=='Wardfort'").value_counts("Company_Name").index[0]

'White, Mcclain and Cobb'

### 57. Change the Data type of 'Employee_Salary' column to float.

In [26]:
df["Employee_Salary"] = df["Employee_Salary"].astype(float)
df.dtypes

Name                   object
Company_Name           object
Employee_Job_Title     object
Employee_City          object
Employee_Country       object
Employee_Salary       float64
Employment_Status      object
Employee_Rating       float64
dtype: object

### 58. Print the Employee_City with the most number of 'Production engineer'.

In [27]:
df.query("Employee_Job_Title == 'Production engineer'").value_counts("Company_Name").index[0]

'Johnston, Fleming and Tanner'

### 59. Print the Company_Name with the most number of Full-time Employees.

In [28]:
df.query("Employment_Status == 'Full Time'").value_counts("Company_Name").index[0]

'Scott Inc'

### 60. Print the Company_Name with the highest average 'Employee_Rating'.

In [29]:
df.groupby("Company_Name").mean("Employee_Rating").sort_values("Employee_Rating", ascending=False).index[0]

'Matthews Inc'

### 61. Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' location combined.

In [30]:
df.query("Employee_City == 'Ricardomouth' or Employee_City == 'Kristaburgh'").shape[0]

60256

### 62. Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.

In [31]:
df.sort_values("Employee_Salary", ascending=False)["Company_Name"].tolist()[:5]

['Taylor-Ramos',
 'Taylor-Ramos',
 'Thomas-Spencer',
 'White, Mcclain and Cobb',
 'Campos, Reynolds and Mccormick']

### 63. Check if there are any duplicate rows in the DataFrame.

In [32]:
df.duplicated().any()

False

### 64. Check if any of the columns has NaN values.

In [33]:
df.isna().any(axis=0)

Name                  False
Company_Name          False
Employee_Job_Title    False
Employee_City         False
Employee_Country      False
Employee_Salary       False
Employment_Status     False
Employee_Rating       False
dtype: bool

### 65. Print the data type of every column in the DataFrame.

In [34]:
df.dtypes

Name                   object
Company_Name           object
Employee_Job_Title     object
Employee_City          object
Employee_Country       object
Employee_Salary       float64
Employment_Status      object
Employee_Rating       float64
dtype: object

### 66. Print the Company_Name column only as a Series

In [35]:
df["Company_Name"]

0                       James and Sons
1                        Nichols-James
2                            Scott Inc
3         Johnston, Fleming and Tanner
4             Baker, Allen and Edwards
                      ...
299995                Bullock-Carrillo
299996    Johnston, Fleming and Tanner
299997                   Nichols-James
299998                   Nichols-James
299999                  James and Sons
Name: Company_Name, Length: 300000, dtype: object

### 67. Print the Company_Name column only as a DataFrame

In [36]:
df[["Company_Name"]]

                        Company_Name
0                     James and Sons
1                      Nichols-James
2                          Scott Inc
3       Johnston, Fleming and Tanner
4           Baker, Allen and Edwards
...                              ...
299995              Bullock-Carrillo
299996  Johnston, Fleming and Tanner
299997                 Nichols-James
299998                 Nichols-James
299999                James and Sons

[300000 rows x 1 columns]

### 68. Select the 'Employee_Job_Title' and 'Employee_City' column.

In [37]:
df.loc[:, ['Employee_Job_Title', 'Employee_City']]

                             Employee_Job_Title      Employee_City
0                               Equities trader     New Russellton
1       Diplomatic Services operational officer  North Melissafurt
2                    Regulatory affairs officer           Wardfort
3                           Production engineer     West Jamesview
4                           Production engineer          Whiteside
...                                         ...                ...
299995                              Optometrist  North Melissafurt
299996                            Administrator         Aliciafort
299997                            Administrator   New Cindychester
299998                                     Make       Whitakerbury
299999                                  Actuary     New Russellton

[300000 rows x 2 columns]

### 69. Print the number of employees with Employee_Rating greater than the average Employee_Rating

In [38]:
df[df["Employee_Rating"] > df['Employee_Rating'].mean()].shape[0]

147548

### 70. Find the employee which has the maximum salary among the ones with  the minimum Employee_Rating

In [39]:
df[
    df["Employee_Rating"] == df["Employee_Rating"].min()
].sort_values("Employee_Salary", ascending=False)["Name"].tolist()[0]

'Austin Poole'

### 71. Sort the DataFrame in ascending order of Employee_Salary

In [40]:
df.sort_values("Employee_Salary")

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
54531,Kristen Vasquez,"White, Mcclain and Cobb",Armed forces logistics/support/administrative ...,Wardfort,Bermuda,0.0,Full Time,3.4
205070,Courtney Singleton,"White, Mcclain and Cobb",Garment/textile technologist,New Cindychester,Ethiopia,0.0,Full Time,2.8
185700,Vanessa Wu,"Campos, Reynolds and Mccormick",Patent examiner,North Melissafurt,Zambia,10.0,Full Time,1.3
226792,Penny Meza,"Wallace, Smith and Shepard",Trading standards officer,Wardfort,Albania,10.0,Full Time,0.7
229395,Grace Smith,"Johnston, Fleming and Tanner",Trading standards officer,West Jamesview,Libyan Arab Jamahiriya,10.0,Intern,1.1
...,...,...,...,...,...,...,...,...
23536,Dennis Sexton,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,Kristaburgh,United Kingdom,999970.0,Full Time,0.9
50461,Logan Jackson,"White, Mcclain and Cobb",Ergonomist,Wardfort,Saint Helena,999980.0,Full Time,2.0
153993,Jason Jenkins,Taylor-Ramos,Sales promotion account executive,Aliciafort,Pakistan,999980.0,Full Time,2.6
51642,Richard Kennedy,Thomas-Spencer,Energy manager,Aliciafort,Cook Islands,999980.0,Full Time,2.4
70356,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990.0,Full Time,4.0

### 72. Sort the DataFrame in descending order of Employee_Rating

In [41]:
df.sort_values("Employee_Rating", ascending=False)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
222544,Laura Lopez,Scott Inc,Equities trader,Whiteside,British Virgin Islands,271140.0,Full Time,5.0
26453,Adriana Ferrell,"Johnston, Fleming and Tanner",Ergonomist,Aliciafort,Gabon,678800.0,Intern,5.0
141265,Russell Dorsey,"Baker, Allen and Edwards",Optometrist,Aliciafort,Morocco,816320.0,Full Time,5.0
184624,Katherine Jenkins,Matthews Inc,Make,New Cindychester,Nauru,498850.0,Full Time,5.0
70533,Brittney Greene,James and Sons,Energy manager,Ricardomouth,Bulgaria,332780.0,Full Time,5.0
...,...,...,...,...,...,...,...,...
50012,Sara King,Matthews Inc,Diplomatic Services operational officer,Whiteside,Iran,986490.0,Intern,0.0
289392,Heather Paul,Nelson-Li,Make,Wardfort,French Southern Territories,712720.0,Full Time,0.0
14752,Kathryn Goodwin,"Baker, Allen and Edwards",Energy manager,New Cindychester,Moldova,557330.0,Full Time,0.0
204854,Nina Yang,"Wallace, Smith and Shepard",Armed forces logistics/support/administrative ...,Wardfort,Swaziland,744300.0,Intern,0.0
242616,Melissa Johnston,Matthews Inc,Diplomatic Services operational officer,Whiteside,Macao,704700.0,Intern,0.0

### 73. Print the name of 100th employee after sorting on Name

In [42]:
df.sort_values("Name")["Name"].tolist()[99]

'Aaron Brown'

### 74. Print the first 5 rows of the first 5 columns.

In [43]:
df.iloc[:5, :5]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica

### 75. Print the transpose of the first 5 rows

In [44]:
df.iloc[:5, :].T

,0,1,2,3,4
Name,Spencer Adkins,Julie Morton,Matthew Hall,Brad Scott,Theresa Owens
Company_Name,James and Sons,Nichols-James,Scott Inc,"Johnston, Fleming and Tanner","Baker, Allen and Edwards"
Employee_Job_Title,Equities trader,Diplomatic Services operational officer,Regulatory affairs officer,Production engineer,Production engineer
Employee_City,New Russellton,North Melissafurt,Wardfort,West Jamesview,Whiteside
Employee_Country,Palestinian Territory,Marshall Islands,Anguilla,Syrian Arab Republic,Dominica
Employee_Salary,321520.0,589090.0,630890.0,116400.0,523499.0
Employment_Status,Full Time,Full Time,Full Time,Full Time,Full Time
Employee_Rating,3.9,4.3,3.1,3.1,4.8

### 76. Print the number of employees whose first name starts with the letter 'V'.

In [45]:
df[df["Name"].str.startswith("V")].shape[0]

3683

### 77. Print the number of employees whose last name starts with the letter 'R'.

In [46]:
df[df["Name"].str.contains(" R")].shape[0]

20712

### 78. Select the rows 2 to 7 and the columns 3 to 7 (both included)

In [47]:
df.iloc[2:8, 3:8]

,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
2,Wardfort,Anguilla,630890.0,Full Time,3.1
3,West Jamesview,Syrian Arab Republic,116400.0,Full Time,3.1
4,Whiteside,Dominica,523499.0,Full Time,4.8
5,Ricardomouth,Mali,850140.0,Full Time,2.6
6,Wardfort,Aruba,711410.0,Full Time,2.0
7,Kristaburgh,Western Sahara,777000.0,Full Time,3.3

### 79. Select every row after the 10th row and select all columns.

In [48]:
df.iloc[11:, :]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
11,Timothy Johnson,"Baker, Allen and Edwards",Regulatory affairs officer,Ricardomouth,Georgia,503610.0,Full Time,2.9
12,Tiffany Galvan,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,West Jamesview,Niger,786430.0,Intern,3.6
13,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210.0,Full Time,4.9
14,Julie Cook,Matthews Inc,Equities trader,New Russellton,Puerto Rico,328860.0,Full Time,4.8
15,David Massey,"Johnston, Fleming and Tanner","Radiographer, therapeutic",Ricardomouth,Somalia,581490.0,Intern,3.7
...,...,...,...,...,...,...,...,...
299995,Nancy Neal,Bullock-Carrillo,Optometrist,North Melissafurt,Samoa,99670.0,Intern,3.3
299996,Michele Butler,"Johnston, Fleming and Tanner",Administrator,Aliciafort,Cuba,949580.0,Intern,2.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830.0,Full Time,0.6
299998,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240.0,Full Time,2.4
299999,Karen Delgado,James and Sons,Actuary,New Russellton,United Kingdom,575770.0,Intern,3.3

### 80. Select every row up to the 10th row and select all columns.

In [49]:
df.iloc[:11, :]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520.0,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090.0,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890.0,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400.0,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499.0,Full Time,4.8
5,Vanessa Allen,Andrade LLC,Make,Ricardomouth,Mali,850140.0,Full Time,2.6
6,Kelly Brown,Andrade LLC,Naval architect,Wardfort,Aruba,711410.0,Full Time,2.0
7,Vicki Beard,Matthews Inc,Diplomatic Services operational officer,Kristaburgh,Western Sahara,777000.0,Full Time,3.3
8,Lisa French,Taylor-Ramos,"Radiographer, therapeutic",West Jamesview,Kuwait,870580.0,Full Time,1.3
9,Michael Edwards,"Campos, Reynolds and Mccormick",Ergonomist,New Cindychester,Lao People's Democratic Republic,516950.0,Full Time,2.3
10,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260.0,Full Time,4.9

### 81. Select rows with employee rating > 4.5.

In [50]:
df.query("Employee_Rating > 4.5")

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499.0,Full Time,4.8
10,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260.0,Full Time,4.9
13,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210.0,Full Time,4.9
14,Julie Cook,Matthews Inc,Equities trader,New Russellton,Puerto Rico,328860.0,Full Time,4.8
49,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320.0,Full Time,4.7
...,...,...,...,...,...,...,...,...
299910,Daniel Johnson,"Baker, Allen and Edwards",Energy manager,Wardfort,American Samoa,452970.0,Full Time,4.7
299952,Joshua Knight,Nichols-James,Sales promotion account executive,Wardfort,Mali,175450.0,Intern,4.9
299957,Martha Phillips,Matthews Inc,Naval architect,Wardfort,Somalia,485270.0,Full Time,4.8
299973,Doris Miller,Andrade LLC,Armed forces logistics/support/administrative ...,Wardfort,Kazakhstan,943340.0,Intern,5.0
299981,Herbert Bailey,Nichols-James,"Radiographer, therapeutic",New Cindychester,Guernsey,165550.0,Full Time,4.8

### 82. Select rows with employee rating > 4.5 and < 4.8.

In [51]:
df.query("4.5 < Employee_Rating < 4.8")

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
49,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320.0,Full Time,4.7
88,Julie Richard,Bullock-Carrillo,Naval architect,Wardfort,Burundi,222850.0,Full Time,4.6
94,Natasha Harmon,Matthews Inc,"Radiographer, therapeutic",West Jamesview,Bolivia,790000.0,Full Time,4.7
119,Jason Parrish,Andrade LLC,Garment/textile technologist,Aliciafort,Cote d'Ivoire,581130.0,Full Time,4.7
129,Connie Coleman,Andrade LLC,Optometrist,Kristaburgh,Indonesia,899260.0,Full Time,4.7
...,...,...,...,...,...,...,...,...
299757,Melissa Perry,Marshall-Holloway,Trading standards officer,Whiteside,Russian Federation,712460.0,Full Time,4.7
299765,Jeremy Ramirez,Thomas-Spencer,Diplomatic Services operational officer,Ricardomouth,Netherlands,330640.0,Intern,4.6
299772,Adam Moss,"Johnston, Fleming and Tanner",Garment/textile technologist,Whiteside,Lao People's Democratic Republic,298790.0,Intern,4.6
299820,Brandi Christian,James and Sons,Make,North Melissafurt,Palestinian Territory,503370.0,Intern,4.6
299910,Daniel Johnson,"Baker, Allen and Edwards",Energy manager,Wardfort,American Samoa,452970.0,Full Time,4.7

### 83. Print the name of the company with the maximum employees having rating > 4.

In [52]:
df.query("Employee_Rating > 4").value_counts("Company_Name").index[0]

'Matthews Inc'

### 84. Print the rating of the employee named 'Julie Morton'.

In [53]:
df.query("Name == 'Julie Morton'")[["Name", "Employee_Rating"]]

           Name  Employee_Rating
1  Julie Morton              4.3

### 85. Print the last 3rd entry in the column Employee_City

In [54]:
df["Employee_City"][-4:-1]

299996          Aliciafort
299997    New Cindychester
299998        Whitakerbury
Name: Employee_City, dtype: object

### 86. Print the Employee_City column as a list

In [55]:
df["Employee_City"].tolist()[:5]  # print 5 items as sample

['New Russellton',
 'North Melissafurt',
 'Wardfort',
 'West Jamesview',
 'Whiteside']

### 87. Are the number of employees in 'Scott Inc' company greater than that in 'Andrade LLC'? Print True/False

In [56]:
df.query("Company_Name == 'Scott Inc'").shape[0] > df.query("Company_Name == 'Andrade LLC'").shape[0]

True

### 88. Which is the most common first name in the dataframe?

In [57]:
temp = df[["Name"]].copy()
temp[["first", "second"]] = df["Name"].str.split(' ', 1, expand=True)
temp.value_counts("first").index[0]

'Michael'

### 89. Which is the least common last name in the dataframe?

In [58]:
temp.value_counts("first").index[-1]

'Terrance'

### 90. What is the average name length?

In [59]:
temp = df[["Name"]].copy()
temp["Name_Length"] = df["Name"].str.len()
temp["Name_Length"].mean()

13.1079

Great job solving this notebook. Go to Pandas Notebook  3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/%2Fnotebook.ipynb)

<a style='text-decoration:none;line-height:16px;display:flex;color:#5B5B62;padding:10px;justify-content:end;' href='https://deepnote.com?utm_source=created-in-deepnote-cell&projectId=7e3b6755-5d4b-464b-9b75-9c84667ae3bd' target="_blank">
<img alt='Created in deepnote.com' style='display:inline;max-height:16px;margin:0px;margin-right:7.5px;' src='' > </img>
Created in <span style='font-weight:600;margin-left:4px;'>Deepnote</span></a>